{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "edtech",
    "1": "four_nations",
    "2": "policy_practice_research",
    "3": "political_environment_key_organisations",
    "4": "teacher_rrd",
    "5": "what_matters_ed"
  },
  "initializer_range": 0.02,
  "label2id": {
    "edtech": 0,
    "four_nations": 1,
    "policy_practice_research": 2,
    "political_environment_key_organisations": 3,
    "teacher_rrd": 4,
    "what_matters_ed": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "vocab_size": 30522
}
